<?php

return [
    'enable' => [
        'header' => 'لم تقم بتفعيل المصادقة الثنائية.',
        'description' => 'عند تفعيل المصادقة الثنائية، سيُطلب منك إدخال رمز عشوائي آمن أثناء المصادقة. يمكنك استرداد هذا الرمز من تطبيق Google Authenticator على هاتفك.',
    ],
    'logout' => [
        'button' => 'تسجيل الخروج',
    ],
    'enabled' => [
        'header' => 'لقد قمت بتفعيل المصادقة الثنائية.',
        'description' => 'احفظ هذه رموز استرجاع حسابك في مدير كلمات المرور الآمنة. يمكن استخدامها لاسترجاع الوصول إلى حسابك إذا فقدت جهاز المصادقة الثنائية.',
    ],
    'setup_confirmation' => [
        'header' => 'إلغاء تفعيل المصادقة الثنائية.',
        'description' => 'عند تفعيل المصادقة الثنائية، سيُطلب منك إدخال رمز عشوائي آمن أثناء المصادقة. يمكنك استرداد هذا الرمز من تطبيق Google Authenticator على هاتفك.',
        'scan_qr_code' => 'لإنهاء تفعيل المصادقة الثنائية، قم بمسح الرمز التالي باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد وأدخل رمز OTP المولد.',
    ],
    'base' => [
        'wrong_user' => 'كائن المستخدم المصادق (User) يجب عليه أن يكون كائن Filament Auth للسماح لصفحة الملف الشخصي بالتحديث.',
        'rate_limit_exceeded' => 'تم إرسال العديد من الطلبات',
        'try_again' => 'يرجى المحاولة مرة أخرى في :seconds ثانية',
    ],
    '2fa' => [
        'confirm' => 'تأكيد',
        'cancel' => 'إلغاء',
        'enable' => 'تفعيل',
        'disable' => 'تعطيل',
        'confirm_password' => 'تأكيد كلمة المرور',
        'wrong_password' => 'كلمة المرور المقدمة غير صحيحة.',
        'code' => 'الرمز',
        'setup_key' => 'مفتاح الإعداد: :setup_key.',
        'current_password' => 'كلمة المرور الحالية',
        'regenerate_recovery_codes' => 'إنشاء رموز استرجاع جديدة',
    ],
    'passkey' => [
        'add' => 'إنشاء مفتاح المصادقة',
        'name' => 'الاسم',
        'added' => 'تم إضافة مفتاح المصادقة بنجاح.',
        'login' => 'تسجيل الدخول باستخدام مفتاح المصادقة',
        'tootip' => 'استخدم بصمة الوجه، بصمة الاصبع أو رمز التحقق',
        'notice' => [
            'header' => 'مفتاح المصادقة هو طريقة لتسجيل الدخول دون كلمة المرور تستخدم تحقق الهوية بالإيماءة (بصمة الاصبع، بصمة الوجه، إلخ). بدلاً من إدخال كلمة المرور، ستقوم بتأكيد تسجيل الدخول على جهازك الموثوق به.',
        ],
    ],
];
